import React from "react";
import Icons from "@/style/icons";

export interface FaqItemResource {
    question: string;
    answer: (context?: any) => React.ReactNode;
}

export const FAQ_TEACHERS_ITEMS = (teacherLink: string): FaqItemResource[] => [
    {
        question: "מה הקישור האישי שלי בלי שאצטרך להזדהות כל פעם מחדש?",
        answer: () => (
            <>
                {teacherLink ? (
                    <div className="teacher-link" style={{ marginTop: '10px' }}>
                        <a href={teacherLink} target="_blank" rel="noopener noreferrer">
                            <strong>הקישור האישי שלכם</strong>
                        </a>
                        &nbsp;&nbsp;
                        <span>(שימרו אותו)</span>
                    </div>
                ) : (
                    <p style={{ marginTop: '10px' }}>כדי לראות את הקישור הייחודי שלך, יש להתחבר קודם למערכת</p>
                )}
            </>
        ),
    },
];

export const FAQ_MANAGER_ITEMS: FaqItemResource[] = [
    {
        question: "במסך שיבוץ יומי, אילו קטגוריות יכולות להופיע בשדה ממלא המקום?",
        answer: () => (
            <>
                <strong>המלצת המערכת:</strong> המערכת מנתחת נתונים הסטוריים כדי לנסות להציע מורים מחליפים עם התאמה.
                <br />
                <strong>מורה נוסף בשיעור:</strong> מורה נוסף המלמד יחד עם המורה החסר באותה כיתה
                ובאותה שעה.
                <br />
                <strong>מורים למילוי מקום:</strong> רשימת המורים המוגדרים כממלאי מקום.
                <br />
                <strong>מורים ללא מערכת:</strong> מורים ללא מערכת קבועה.
                <br />
                <strong>מורים פנויים:</strong> מורים המלמדים ביום זה ופנויים בשעה הנדרשת.
                <br />
                <strong>מורים בקבוצת עבודה:</strong> מורים בקבוצה כגון פרטני, שהייה, מפגש צוות
                ועוד...
                <br />
                <strong>מורים מלמדים בכיתה אחרת:</strong> מורים המלמדים בשעה זו.
                <br />
                <strong>לא התחילו/סיימו את היום:</strong> מורים אשר מלמדים היום אך טרם הגיעו או
                כבר סיימו את יום העבודה.
                <br />
                <strong>ביום חופשי:</strong> מורים שאינם מלמדים ביום זה.
                <br />
                <br />
                <div style={{ marginRight: "20px" }}>
                    <ul>
                        <li>אפשר לכתוב גם טקסט חופשי.</li>
                        <li>בעת הקלדה, הרשימה מסוננת בהתאם לטקסט שהוזן.</li>
                        <li>הקטגוריות מוצגות בהתאם לשעה שנבחרה ולמצב המורים בפועל באותה שעה.</li>
                    </ul>
                </div>
            </>
        ),
    },
    {
        question: "באילו סוגי משתמשים המערכת תומכת ואיך שולחים להם קישור להתחברות?",
        answer: () => (
            <>
                <strong>מורי בית הספר</strong>
                <br />
                מורי בית הספר הקבועים, בעלי מערכת שעות קבועה לאורך השנה.
                <br />
                <br />
                אפשרות 1:
                נכנסים למסך השיבוץ היומי, לוחצים על כפתור השיתוף (<Icons.share size={16} />)
                ושולחים את הקישור לכל המורים. כאשר המורה נכנס לקישור, הוא יבחר את שמו מתוך
                הרשימה.
                <br />
                <br />
                אפשרות 2:
                נכנסים למסך המורים ומפיקים קישור אישי (כפתור השיתוף <Icons.share size={16} />)
                עבור כל מורה בנפרד.
                <br />
                <br />
                <strong>מורים למילוי מקום</strong>
                <br />
                מורים ללא מערכת קבועה שאינם בצוות הקבוע, המוזמנים לפי הצורך.
                <br />
                יכולים להתחבר רק דרך קישור אישי.<br />
                נכנסים למסך מורים ממלאי מקום, לוחצים על כפתור השיתוף ושולחים להם
                את הקישור האישי.
                <br />
                מורה ממלא מקום רואה רק את המערכת האישית שלו ואינו חשוף לשינויים במערכת הבית ספרית.
                אפשר לשנות את זה דרך הגדרות המערכת (<Icons.settings size={16} />).
                <br />
                <br />
                <strong>אנשי מנהלה</strong>
                <br />
                אנשי מנהלה הם חברי סגל (כגון מזכירות) שאינם עוסקים בהוראה, אך ניתנת להם הרשאת צפייה במערכת לצורך תיאום לוגיסטי.
                <br />
                גם הם יכולים להתחבר רק דרך קישור אישי.
                <br />
                <br />
                <strong>מרגע שנשלח הקישור הוא נשאר תקף לתמיד ואין צורך לשלוח אותו שוב.</strong>
            </>
        ),
    },
    {
        question: "כיצד ניתן לבדוק את המערכת ולראות אותה כפי שהמורים רואים אותה?",
        answer: () => (
            <>
                במסך שיבוץ יומי יש ללחוץ על כפתור התצוגה המקדימה (<Icons.eye size={22} />
                ).
                <br />
                במסך שייפתח תוצג המערכת היומית כפי שהמורים רואים.
            </>
        ),
    },
    {
        question: "כיצד ניתן לראות או לעדכן חומר לימוד עבור מורה חסר?",
        answer: () => (
            <>
                במסך שיבוץ יומי - צפיה מקדימה, לחצו על כותרת העמודות עם שמות המורים.
                <br />
                במסך שייפתח תוצג המערכת היומית של המורה ושם ניתן לצפות בחומר הלימוד שהוזן או
                לעדכן אותו במידת הצורך.
            </>
        ),
    },
    {
        question: "אם אני מעדכן את המערכת אחרי הפרסום האם המורים יראו את העדכונים?",
        answer: () => (
            <>
                כן.
                <br />
                לאחר שהמערכת היומית פורסמה כל שינוי נוסף מוצג למורים באופן אוטומטי.
            </>
        ),
    },
];
