const messages = {
    common: {
        invalid: "חסרים פרמטרים",
        serverError: "שגיאה בשליפת הנתונים. נא לרענן את הדף ולנסות שוב"
    },
    auth: {
        accessDenied: "נראה שהגעתם לאזור המיועד למנהלי המערכת. אם ברצונכם להצטרף או להתנסות בשיבוץ+, כיתבו לנו ל-contact@shibutzplus.com",
        unauthorized: "אין הרשאה. יש להתחבר כדי לגשת למידע זה",
        paramRequired: "פרמטר נדרש",
        login: {
            failed: "ההתחברות נכשלה",
            success: "ההתחברות הצליחה",
            invalidCredentials: "אימייל או סיסמה שגויים",
            adminOnly: "כניסה זו מיועדת למנהלי מערכת בלבד"
        },
        register: {
            failed: "ההרשמה נכשלה",
            emailInUse: "האימייל כבר בשימוש",
            invalid: "חסרים פרמטרים",
            success: "ההרשמה הסתיימה בהצלחה",
            error: "שגיאה"
        }
    },
    school: {
        notFound: "בית הספר לא נמצא",
        success: "מידע על בית הספר נשלף בהצלחה",
    },
    teachers: {
        success: "רשימת מורים נטענה בהצלחה",
        error: "בעיה בטעינת רשימת המורים. נא לרענן את הדף ולנסות שוב",
        createSuccess: "מורה נוסף בהצלחה",
        createError: "בעיה בהוספת מורה. נא לרענן ולנסות שוב",
        deleteSuccess: "מורה נמחק בהצלחה",
        deleteError: "בעיה במחיקת מורה. נא לרענן ולנסות שוב",
        invalid: "חסרים פרמטרים",
        updateSuccess: "מורה עודכן בהצלחה",
        updateError: "בעיה בעדכון המורה. נא לרענן ולנסות שוב",
        needToSelect: "יש לבחור מורה מהרשימה"
    },
    subjects: {
        success: "רשימת מקצועות נטענה בהצלחה",
        error: "בעיה בטעינת רשימת המקצועות. נא לרענן את הדף ולנסות שוב",
        createSuccess: "מקצוע נוסף בהצלחה",
        createError: "בעיה בהוספת מקצוע. נא לרענן ולנסות שוב",
        deleteSuccess: "מקצוע נמחק בהצלחה",
        deleteError: "בעיה במחיקת המקצוע. נא לרענן ולנסות שוב",
        invalid: "חסרים פרמטרים",
        updateSuccess: "מקצוע עודכן בהצלחה",
        updateError: "בעיה בעדכון המקצוע. נא לרענן ולנסות שוב",
    },
    classes: {
        success: "רשימת כיתות/קבוצות נטענה בהצלחה",
        error: "בעיה בטעינת רשימת כיתות/קבוצות. נא לרענן את הדף ולנסות שוב",
        createClassSuccess: "כיתה נוספה בהצלחה",
        createError: "בעיה בהוספת כיתה/קבוצה. נא לרענן ולנסות שוב",
        deleteClassSuccess: "כיתה נמחקה בהצלחה",
        deleteGroupSuccess: "קבוצה נמחקה בהצלחה",
        deleteError: "בעיה במחיקת כיתה/קבוצה. נא לרענן ולנסות שוב",
        invalid: "חסרים פרמטרים",
        updateClassSuccess: "כיתה/קבוצה עודכנה בהצלחה",
        updateError: "בעיה בעדכון כיתה/קבוצה. נא לרענן ולנסות שוב",
    },
    annualSchedule: {
        success: "מערכת שנתית נטענה בהצלחה",
        error: "בעיה בטעינת המערכת השנתית. נא לרענן את הדף ולנסות שוב",
        createSuccess: "שעה נוספה למערכת בהצלחה",
        createError: "בעיה בהוספת שעה למערכת השנתית. נא לרענן ולנסות שוב",
        deleteSuccess: "שעה נמחקה מהמערכת",
        deleteError: "בעיה במחיקת שעה. נא לרענן ולנסות שוב",
        updateSuccess: "השעה עודכנה בהצלחה",
    },
    dailySchedule: {
        success: "המערכת היומית נטענה בהצלחה",
        error: "בעיה בטעינת המערכת היומית. נא לרענן את הדף ולנסות שוב",
        createSuccess: "שעה נוספה למערכת היומית",
        createError: "בעיה בהוספת שעה למערכת היומית. נא לרענן ולנסות שוב",
        updateSuccess: "השעה עודכנה בהצלחה",
        updateError: "בעיה בעדכון שעה במערכת היומית. נא לרענן ולנסות שוב",
        deleteSuccess: "העמודה נמחקה",
        deleteError: "בעיה במחיקת עמודה במערכת היומית. נא לרענן ולנסות שוב",
        noScheduleFound: "לא נמצאו שעות לימוד למורה ביום זה",
        notPublished: "המערכת היומית לא פורסמה",
    },
    publish: {
        success: "המערכת היומית פורסמה וזמינה למורים",
        error: "בעיה בפרסום המערכת. נא לרענן את הדף ולנסות שוב",
    },
    system: {
        versionUpdate: "הדף יתרענן אוטומטית בעוד מספר שניות לעדכון גרסה, ואז אפשר להמשיך כרגיל...",
    }
}

export default messages;
